; domain
(define (domain moving)
    (:requirements :typing)
    (:types 
        location truck direction - object
    )
    (:predicates
        (dirof ?obj1 - object ?dir - direction ?obj2 - object)
        (rightof ?dir1 - direction ?dir2 - direction)
        (leftof ?dir1 - direction ?dir2 - direction)
        (facedir ?t - truck ?dir - direction)
        (at ?t - truck ?loc - location)
        (empty ?loc - location)
    )
    (:action move-forward
        :parameters     (?t - truck ?lf - location ?dir - direction ?lt - location)
        :precondition   (and (at ?t ?lf) (facedir ?t ?dir) (dirof ?lt ?dir ?lf) (empty ?lt))
        :effect         (and (not (at ?t ?lf)) (empty ?lf) (facedir ?t ?dir) (not (empty ?lt)) (at ?t ?lt))
    )
    (:action rotate-right
        :parameters     (?t - truck ?df - direction ?dt - direction)
        :precondition   (and (facedir ?t ?df) (rightof ?dt ?df))
        :effect         (and (facedir ?t ?dt) (not (facedir ?t ?df)))
    )
    (:action rotate-left
        :parameters     (?t - truck ?df - direction ?dt - direction)
        :precondition   (and (facedir ?t ?df) (leftof ?dt ?df))
        :effect         (and (facedir ?t ?dt) (not (facedir ?t ?df)))
    )
    
)

; problem
(define (problem moving1)
    (:domain moving)
    (:objects
        loc00 - location
        loc01 - location
        loc02 - location
        loc10 - location
        loc11 - location
        loc12 - location
        loc20 - location
        loc21 - location
        loc22 - location
        east - direction
        west - direction
        south - direction
        north - direction
        tru1 - truck
        tru2 - truck
        tru3 - truck
    )
    (:init
        (dirof loc01 east loc00)
        (dirof loc02 east loc01)
        (dirof loc11 east loc10)
        (dirof loc12 east loc11)
        (dirof loc21 east loc20)
        (dirof loc22 east loc21)
        (dirof loc10 south loc00)
        (dirof loc20 south loc10)
        (dirof loc11 south loc01)
        (dirof loc21 south loc11)
        (dirof loc12 south loc02)
        (dirof loc22 south loc12)
        (dirof loc01 west loc02)
        (dirof loc00 west loc01)
        (dirof loc11 west loc12)
        (dirof loc10 west loc11)
        (dirof loc21 west loc22)
        (dirof loc20 west loc21)
        (dirof loc10 north loc20)
        (dirof loc00 north loc10)
        (dirof loc11 north loc21)
        (dirof loc01 north loc11)
        (dirof loc12 north loc22)
        (dirof loc02 north loc12)
        (rightof east north)
        (rightof south east)
        (rightof west south)
        (rightof north west)
        (leftof east south)
        (leftof north east)
        (leftof west north)
        (leftof south west)
        (at tru1 loc00)
        (at tru2 loc01)
        (at tru3 loc02)
        (empty loc10)
        (empty loc11)
        (empty loc12)
        (empty loc20)
        (empty loc21)
        (empty loc22)
        (facedir tru1 east)
        (facedir tru2 north)
        (facedir tru3 east)
    )
    (:goal
        (and
            (at tru1 loc11)
            (at tru2 loc21)
            (at tru3 loc20)
        )
    )
)

; plan
1. (rotate-left tru2 north west)
   deleted: (facedir tru2 north)
   added: (facedir tru2 west)
   goals met: 0 of 3
2. (rotate-left tru2 west south)
   deleted: (facedir tru2 west)
   added: (facedir tru2 south)
   goals met: 0 of 3
3. (move-forward tru2 loc01 south loc11)
   deleted: (at tru2 loc01) (empty loc11)
   added: (empty loc01) (at tru2 loc11)
   goals met: 0 of 3
4. (move-forward tru2 loc11 south loc21)
   deleted: (at tru2 loc11) (empty loc21)
   added: (empty loc11) (at tru2 loc21)
   goals met: 1 of 3
5. (move-forward tru1 loc00 east loc01)
   deleted: (at tru1 loc00) (empty loc01)
   added: (empty loc00) (at tru1 loc01)
   goals met: 1 of 3
6. (rotate-right tru1 east south)
   deleted: (facedir tru1 east)
   added: (facedir tru1 south)
   goals met: 1 of 3
7. (move-forward tru1 loc01 south loc11)
   deleted: (at tru1 loc01) (empty loc11)
   added: (empty loc01) (at tru1 loc11)
   goals met: 2 of 3
8. (rotate-left tru3 east north)
   deleted: (facedir tru3 east)
   added: (facedir tru3 north)
   goals met: 2 of 3
9. (rotate-left tru3 north west)
   deleted: (facedir tru3 north)
   added: (facedir tru3 west)
   goals met: 2 of 3
10. (move-forward tru3 loc02 west loc01)
   deleted: (at tru3 loc02) (empty loc01)
   added: (empty loc02) (at tru3 loc01)
   goals met: 2 of 3
11. (move-forward tru3 loc01 west loc00)
   deleted: (at tru3 loc01) (empty loc00)
   added: (empty loc01) (at tru3 loc00)
   goals met: 2 of 3
12. (rotate-left tru3 west south)
   deleted: (facedir tru3 west)
   added: (facedir tru3 south)
   goals met: 2 of 3
13. (move-forward tru3 loc00 south loc10)
   deleted: (at tru3 loc00) (empty loc10)
   added: (empty loc00) (at tru3 loc10)
   goals met: 2 of 3
14. (move-forward tru3 loc10 south loc20)
   deleted: (at tru3 loc10) (empty loc20)
   added: (empty loc10) (at tru3 loc20)
   goals met: 3 of 3
